Table of Contents
 Class WcfErrorHandler
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
For more details see https://www.c-sharpcorner.com/UploadFile/b182bf/centralize-exception-handling-in-wcf-part-10/
public class WcfErrorHandler : IErrorHandler
Inheritance
object
WcfErrorHandler
Implements
IErrorHandler
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Logger
public static IPluginLogger Logger { get; }
Property Value
IPluginLogger
Methods
 HandleError(Exception)
HandleError. Log an error, then allow the error to be handled as usual.
public bool HandleError(Exception error)
Parameters
error Exception
Exception
Returns
bool
Return true if the error is considered as already handled
 InitLogger(IPluginLogger)
It initialize error pluginLogger for all instances of WcfErrorHandler Only the first initialization is executed
public static void InitLogger(IPluginLogger logger)
Parameters
logger IPluginLogger
The instance of the pluginLogger where all wcf errors will be written
 ProvideFault(Exception, MessageVersion, ref Message)
Provide a fault. The Message fault parameter can be replaced, or set to null to suppress reporting a fault.
public void ProvideFault(Exception error, MessageVersion version, ref Message fault)
Parameters
error Exception
version MessageVersion
fault Message
 Edit this page